podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SYSMPU_MK28F15.svd.xml
<!--
Devices using this peripheral: 
      MK28F15
-->
      <peripheral>
         <?sourceFile "SYSMPU_MK28F15" ?>
         <name>SYSMPU</name>
         <description>Memory protection unit</description>
         <groupName>SYSMPU</groupName>
         <prependToName>MPU_</prependToName>
         <headerStructName>SYSMPU</headerStructName>
         <baseAddress>0x4000D000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x10</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x400</offset>
            <size>0xC0</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x800</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CESR</name>
               <description>Control/Error Status Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x815101</resetValue>
               <fields>
                  <field>
                     <name>VLD</name>
                     <description>Valid</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>MPU is disabled. All accesses from all bus masters are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>MPU is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NRGD</name>
                     <description>Number Of Region Descriptors</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>8 region descriptors</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>12 region descriptors</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>16 region descriptors</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NSP</name>
                     <description>Number Of Slave Ports</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HRL</name>
                     <description>Hardware Revision Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SPERR</name>
                     <description>Slave Port n Error</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No error has occurred for slave port n</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>An error has occurred for slave port n</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EAR0</name>
               <description>Error Address Register, slave port n</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EADDR</name>
                     <description>Error Address</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>EDR0</name>
               <description>Error Detail Register, slave port n</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERW</name>
                     <description>Error Read/Write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Read</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EATTR</name>
                     <description>Error Attributes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>User mode, instruction access</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>User mode, data access</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Supervisor mode, instruction access</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Supervisor mode, data access</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMN</name>
                     <description>Error Master Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPID</name>
                     <description>Error Process Identification</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EACD</name>
                     <description>Error Access Control Detail</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EAR1</name>
               <description>Error Address Register, slave port n</description>
               <addressOffset>0x18</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EADDR</name>
                     <description>Error Address</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>EDR1</name>
               <description>Error Detail Register, slave port n</description>
               <addressOffset>0x1C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERW</name>
                     <description>Error Read/Write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Read</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EATTR</name>
                     <description>Error Attributes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>User mode, instruction access</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>User mode, data access</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Supervisor mode, instruction access</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Supervisor mode, data access</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMN</name>
                     <description>Error Master Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPID</name>
                     <description>Error Process Identification</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EACD</name>
                     <description>Error Access Control Detail</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EAR2</name>
               <description>Error Address Register, slave port n</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EADDR</name>
                     <description>Error Address</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>EDR2</name>
               <description>Error Detail Register, slave port n</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERW</name>
                     <description>Error Read/Write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Read</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EATTR</name>
                     <description>Error Attributes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>User mode, instruction access</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>User mode, data access</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Supervisor mode, instruction access</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Supervisor mode, data access</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMN</name>
                     <description>Error Master Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPID</name>
                     <description>Error Process Identification</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EACD</name>
                     <description>Error Access Control Detail</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EAR3</name>
               <description>Error Address Register, slave port n</description>
               <addressOffset>0x28</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EADDR</name>
                     <description>Error Address</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>EDR3</name>
               <description>Error Detail Register, slave port n</description>
               <addressOffset>0x2C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERW</name>
                     <description>Error Read/Write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Read</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EATTR</name>
                     <description>Error Attributes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>User mode, instruction access</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>User mode, data access</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Supervisor mode, instruction access</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Supervisor mode, data access</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMN</name>
                     <description>Error Master Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPID</name>
                     <description>Error Process Identification</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EACD</name>
                     <description>Error Access Control Detail</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EAR4</name>
               <description>Error Address Register, slave port n</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EADDR</name>
                     <description>Error Address</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>EDR4</name>
               <description>Error Detail Register, slave port n</description>
               <addressOffset>0x34</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERW</name>
                     <description>Error Read/Write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Read</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EATTR</name>
                     <description>Error Attributes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>User mode, instruction access</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>User mode, data access</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Supervisor mode, instruction access</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Supervisor mode, data access</description>
                           <value>0b011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMN</name>
                     <description>Error Master Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPID</name>
                     <description>Error Process Identification</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EACD</name>
                     <description>Error Access Control Detail</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
